namespace HexoGrid
{
    /// <summary>
    /// Для координат смещения важен тип сетки.
    /// </summary>
    public enum HexGridType
    {
        /// <summary>
        /// Горизонтальная. <see cref="Нечетные"/> строки сдвинуты <see cref="влево"/>.<br />
        /// <br />
        /// 
        /// /\/\/\   <br />
        /// ||||||   <br />
        /// \/\/\/\  <br />
        ///  ||||||  <br />
        /// /\/\/\/  <br />
        /// ||||||   <br />
        /// \/\/\/   <br />
        /// </summary>
        HorizontalOdd,
        /// <summary>
        /// Горизонтальная. <see cref="Четные"/> строки сдвинуты <see cref="влево"/>.<br />
        /// <br />
        /// 
        ///  /\/\/\  <br />
        ///  ||||||  <br />
        /// /\/\/\/  <br />
        /// ||||||   <br />
        /// \/\/\/   <br />
        ///  /\/\/\  <br />
        ///  ||||||  <br />
        ///  \/\/\/  <br />
        /// </summary>
        HorizontalEven,
        /// <summary>
        /// Вертикальная. <see cref="Нечетные"/> столбцы сдвинуты <see cref="вверх"/>.<br />
        /// <br />
        ///  _   _   _   <br />
        /// / \_/ \_/ \  <br />
        /// \_/ \_/ \_/  <br />
        /// / \_/ \_/ \  <br />
        /// \_/ \_/ \_/  <br />
        /// / \_/ \_/ \  <br />
        /// \_/ \_/ \_/  <br />
        /// </summary>
        VerticalOdd,
        /// <summary>
        /// Вертикальная. <see cref="Четные"/> столбцы сдвинуты <see cref="вверх"/>.<br />
        /// <br />
        ///    _   _   _   <br />
        ///  _/ \_/ \_/ \  <br />
        /// / \_/ \_/ \_/  <br />
        /// \_/ \_/ \_/ \  <br />
        /// / \_/ \_/ \_/  <br />
        /// \_/ \_/ \_/ \  <br />
        /// / \_/ \_/ \_/  <br />
        /// \_/ \_/ \_/    <br />
        /// </summary>
        VerticalEven
    }
}
